{
  "list": [
    {
      "index": 1,
      "name": "XBox Wireless Controller - Shock Blue",
      "image_url": "https://i5.walmartimages.com/asr/72255485-58c1-424a-b271-bfcdc621fcce.b7d77db2354db33e1fe2a506f5fb133f.jpeg?odnHeight=350&odnWidth=350&odnBg=FFFFFF",
      "category": "electronics",
      "definition": "Experience the modernized design of the Xbox Wireless Controller in Shock Blue, featuring sculpted surfaces and refined geometry for enhanced comfort during gameplay. Stay on target with a hybrid D-pad and textured grip on the triggers, bumpers, and back case. Seamlessly capture and share content such as screenshots, recordings, and more with the new Share button. Use the Xbox Accessories app to remap buttons and create custom controller profiles for your favorite games. Quickly pair with, play on, and switch between devices including Xbox Series X, Xbox One, Windows 10 PCs, and Android. iOS support coming in the future. Plug in any compatible headset with the 3.5mm audio jack.*",
      "price": 59.99,
      "stock": 10,
      "rating": 4.3,
      "comments": {},
      "sellers": {}
    },
    {
      "index": 2,
      "name": "PS5 Pulse 3D Wireless Headset",
      "image_url": "https://i5.walmartimages.com/asr/ebe1bcf9-1ffd-4793-b3b8-7a94a54e64a4.7044a2a1d2c31de80631e73627fb1424.jpeg?odnHeight=350&odnWidth=350&odnBg=FFFFFF",
      "category": "electronics",
      "definition": "Play in comfort with a wireless headset fine-tuned for 3D Audio on PS5 consoles. Featuring USB Type-C®  charging and dual noise-cancelling microphones, you can keep the party chat flowing with crystal-clear voice capture.",
      "price": 99.99,
      "stock": 5,
      "rating": 4.6,
      "comments": {},
      "sellers": {}
    },
    {
      "index": 3,
      "name": "THE SIMPSONS ARCADE 1UP WITH RISER, ARCADE 1UP",
      "image_url": "https://i5.walmartimages.com/asr/7c5d5b5d-816a-42ca-a58f-6a67d9656b64.20e8d0feda91450edd0c74a121bfa84e.jpeg?odnHeight=175&odnWidth=175&odnBg=FFFFFF",
      "category": "electronics",
      "definition": "THE SIMPSONS ARCADE 1UP WITH RISER, ARCADE 1UP\nThe Simpson Arcade1Up with Riser, Arcade1Up\n-Includes 2 classic THE SIMPSONS™ titles:\nThe Simpsons™\nSimpsons™ Bowling",
      "price": 529.99,
      "stock": 3,
      "rating": 4.4,
      "comments": {},
      "sellers": {}
    },
    {
      "index": 4,
      "name": "Blue Diamond 12-Piece Toxin-Free Ceramic Cookware Set",
      "image_url": "https://i5.walmartimages.com/asr/ec06f035-fe06-4533-8d7b-599d8e6c8a93_2.7ed495972c4f735d42dfc11171294719.jpeg?odnHeight=175&odnWidth=175&odnBg=FFFFFF",
      "category": "kitchen",
      "definition": "Make a wide variety of memorable meals with the Blue Diamond Cookware Set. It features a special non-stick coating that's very strong and many times harder than other coatings for long life and top performance. This 12-piece cookware set doesn't contain any harmful PFAS, lead or other substances for healthier eating. Plus, each piece is safe for using with metal utensils. This kitchen cookware set heats four times as fast as other pans, and the food releases easily. When finished, simply place them in your dishwasher for convenient cleaning.",
      "price": 99.99,
      "stock": 10,
      "rating": 4.2,
      "comments": {},
      "sellers": {}
    },
    {
      "index": 5,
      "name": "Mainstays Camfield 20 Piece Stainless Steel Flatware Set",
      "image_url": "https://i5.walmartimages.com/asr/dc6d1b68-d7fe-4379-81e4-049fc89cca7f_2.9f98cc2ccaf31d7216824410ad59cc71.jpeg?odnHeight=175&odnWidth=175&odnBg=FFFFFF",
      "category": "kitchen",
      "definition": "The 20pc Cam field Flatware Set by Mainstays is great for everyday use, however stylish enough to entertain guests with. The mirrored finish will bring comfort and charm to your dinner table. Set includes 20 pieces total, with 4 complete place settings. Make the Mainstays Camfield 20 Piece Flatware Set the next addition to your dining arsenal. Set includes 20 pieces total, with 4 complete place settings.",
      "price": 10.99,
      "stock": 25,
      "rating": 4.4,
      "comments": {},
      "sellers": {}
    },
    {
      "index": 6,
      "name": "ProForm Pro 2000 Smart Treadmill",
      "image_url": "https://i5.walmartimages.com/asr/d4dedc58-91a7-4c36-af98-d275679be7a9.3d58ef968f79517f334f8222ceb2d14b.jpeg?odnHeight=175&odnWidth=175&odnBg=FFFFFF",
      "category": "sports",
      "definition": "If you’re looking for a comprehensive training tool, look no further than the ProForm Pro 2000 smart treadmill. With an included 30-day iFIT membership, you can transform your treadmill into your own home fitness hub. Stream thousands of live and on-demand workouts led by expert iFIT Trainers who teach you proper form and motivate you to succeed. Virtually travel the world with Global Workouts, experiencing everything from vast African savannahs to frozen arctic peaks. Stream live and on-demand Studio Classes, where you can sweat alongside virtual classmates and compete against other iFIT members on the Leaderboard. With Automatic Trainer Control, your treadmill’s speed and incline will auto-adjust to match global terrains and meet trainer suggestions. If you have a Bluetooth heart rate monitor (sold separately) you can experience ActivePulse, exclusive technology that adjusts your workout intensity to keep you in your target heart rate zone. Stream all your favorite workouts through a luxurious 10” HD touchscreen, and run with confidence knowing your treadmill is powered by a self-cooling Mach Z motor. You’ve got this!",
      "price": 1399.99,
      "stock": 3,
      "rating": 4.5,
      "comments": {},
      "sellers": {}
    },
    {
      "index": 7,
      "name": "Spalding Eco-Composite 32 in. Basketball Hoop",
      "image_url": "https://i5.walmartimages.com/asr/114215ff-49cb-4cb1-9712-f608349100ec.b0d801e2c85bd1cb287ca4f4b94e5ff1.jpeg?odnHeight=175&odnWidth=175&odnBg=FFFFFF",
      "category": "sports",
      "definition": "It all starts with a hoop and a dream. Cultivate a love of the game with this portable hoop system that provides a fun playing experience for kids ages 8 and under. This adjustable hoop has a durable fan-shaped backboard and a standard rim that you can raise or lower using the telescoping lift, which adjusts from 4.5 feet to 6.5 feet. The base fills with 14 gallons of water to give it the stability needed for every banked-in jump shot.",
      "price": 98.99,
      "stock": 0,
      "rating": 3.4,
      "comments": {},
      "sellers": {}
    },
    {
      "index": 8,
      "name": "Bowflex PR1000 Home Vertical Folding Bench",
      "image_url": "https://i5.walmartimages.com/asr/63068d44-0c85-4bd2-9438-f218c566fd4b_1.7d891edb42afd04a660023b673ba05a7.jpeg?odnHeight=175&odnWidth=175&odnBg=FFFFFF",
      "category": "sports",
      "definition": "Overview: The Bowflex PR1000 home gym helps strengthen your muscles and add a bit of cardio training to the mix with over 25 strength exercises and a built-in rowing station. With up to 210 pounds of Power Rod resistance included in this exercise equipment, this Bowflex home gym helps work the abs, arms, chest, back, shoulders, and lower body. Bowflex Home Gym and Adjustable Weight Bench: The Bowflex PR1000 Home Gym is also an adjustable weight bench with multiple cable pully positions that allow you to easily change the angle of resistance and increase the effectiveness of many exercises. The adjustable weight bench folds up and down, and can be used as an aerobic rower along with a horizontal bench press, which are just a few of the functions of this home gym fitness equipment. Get Fit On A Budget: If you are on a budget but looking for a total body workout, the Bowflex® PR1000 is your ideal home gym and adjustable weight bench. With over 25 strength exercises and a built-in rowing station for a calorie blasting workout, the PR1000 is a great way to begin your training routine. Exercise equipment folds for easy storage.",
      "price": 499.99,
      "stock": 0,
      "rating": 4.5,
      "comments": {},
      "sellers": {}
    }
  ]
}
